saschaklick/nodem-nrf9151/zephyr-app/src/modem_task.c
#include "modem_task.h"

#include <ctype.h>
#include <errno.h>
#include <limits.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include <zephyr/kernel.h>
#include <zephyr/sys/atomic.h>
#include <zephyr/sys/ring_buffer.h>
#include <zephyr/net/socket.h>
#include <zephyr/net/tls_credentials.h>
#include <zephyr/net/websocket.h>
/* NCS v3.4.1: <zephyr/net/socket.h> no longer aliases the plain POSIX names
 * (socket()/connect()/send()/recv()/close()/getaddrinfo()/setsockopt(),
 * struct addrinfo) even with CONFIG_POSIX_API=y - they now live in these
 * headers instead (netdb.h #define's addrinfo to zsock_addrinfo). */
#include <zephyr/posix/netdb.h>
#include <zephyr/posix/sys/socket.h>
#include <zephyr/posix/unistd.h>

#include <modem/nrf_modem_lib.h>
#include <modem/lte_lc.h>
#include <modem/modem_key_mgmt.h>
#include <nrf_modem_at.h>

#include "config_store.h"
#include "log.h"
#include "nodem_ffi.h"
#include "nodem_task.h"

#define TAG "modem"

/* Not TLS_HOSTNAME/TLS_PORT - those would collide with zephyr/net/socket.h's
 * own TLS_HOSTNAME (a SOL_TLS sockopt name, unrelated to this string). Used
 * as the fallback when config_store's "cloud_host" (control.rs's "#host",
 * matching nodem-esp32's NVS_KEY_CLOUD_HOST) is unset or empty - see
 * get_cloud_host(). */
#define MODEM_TASK_HOSTNAME "docker.ws-ai-call-bot.workers.dev"
#define MODEM_TASK_PORT     "443"
#define TLS_SEC_TAG          42

/* config_store's MAX_STR_LEN (127) + NUL. */
#define CLOUD_HOST_LEN 128

/* The host currently in use, set by step_tls_connect() and reused by
 * step_register() for its request's Host header - both need to agree on
 * exactly the same host, and re-reading config_store independently in each
 * could in principle race a "#host" arriving in between. */
static char g_cloud_host[CLOUD_HOST_LEN];

/* Re-read on every connection attempt (not just once), so a "#host"
 * provisioned while idle takes effect on the very next one. A stored value
 * of "" counts as unset too, same as never having stored one - that's what
 * a bare "#host" (clearing back to the default) actually writes, since
 * config_store has no separate "remove". */
static void get_cloud_host(char *buf, size_t buf_len)
{
	config_get_str("cloud_host", buf, buf_len, "");
	if (buf[0] == '\0') {
		strncpy(buf, MODEM_TASK_HOSTNAME, buf_len - 1);
		buf[buf_len - 1] = '\0';
	}
}

/* Root CA the endpoint's leaf certificate chains to (see /certs) - embedded
 * as a byte array at build time by CMakeLists.txt's generate_inc_file_for_target(). */
static const char ca_cert[] = {
#include "gts-root-r4.pem.inc"
};

BUILD_ASSERT(sizeof(ca_cert) < KB(4), "certificate too large");

enum modem_step {
	MODEM_STEP_INIT = 0,
	MODEM_STEP_SIM,
	MODEM_STEP_PDN,
	MODEM_STEP_TLS,
	MODEM_STEP_REGISTER,
	MODEM_STEP_WEBSOCKET,
	MODEM_STEP_COUNT,
};

static const char *const step_name[MODEM_STEP_COUNT] = {
	[MODEM_STEP_INIT] = "init",
	[MODEM_STEP_SIM] = "sim",
	[MODEM_STEP_PDN] = "pdn",
	[MODEM_STEP_TLS] = "tls",
	[MODEM_STEP_REGISTER] = "reg",
	[MODEM_STEP_WEBSOCKET] = "ws",
};

enum step_state {
	STEP_PENDING = 0,
	STEP_RUNNING,
	STEP_OK,
	STEP_ERROR,
};

struct step_status {
	atomic_t state;
	atomic_t err;
};

static struct step_status g_status[MODEM_STEP_COUNT];
static atomic_t g_tls_fd = ATOMIC_INIT(-1);

/* The websocket id returned by websocket_connect() (distinct from g_tls_fd,
 * the raw socket it wraps - see step_websocket_connect()'s doc comment). */
static atomic_t g_ws_sock = ATOMIC_INIT(-1);

/* Bridges the websocket to nodem_process_command() (see nodem_task.c's
 * nodem_process_ws()) across the thread boundary - websocket_supervise()
 * (this file's own thread) and nodem_task() (a different thread, the only
 * one ever allowed to touch nodem-ffi's runtime/DOM state) each only ever
 * act as a single producer or single consumer of a given ring, which is
 * what makes plain ring_buf safe here without an extra mutex - same
 * precondition uart_task.c's ISR/thread pair already relies on.
 *
 * Two separate rings rather than one shared buffer, and for a reason
 * beyond just direction: routing a reply needs to remember *which*
 * transport a command arrived on, and a single merged byte stream loses
 * that the instant two commands interleave. Keeping this transport's
 * bytes (and nodem_task.c's own line-accumulation buffer for them)
 * entirely separate from uart_task.c's is what preserves that pairing -
 * every reply generated while draining ws_rx_ring is guaranteed to belong
 * on the websocket, because nothing else could have gotten mixed into it.
 *
 * No ring buffer for TX on the UART side (uart_task_write() just blocks
 * synchronously via uart_poll_out(), callable from any thread) - but
 * sending here means calling websocket_send_msg() on g_ws_sock, which only
 * this file's own thread may touch, so a TX ring (drained by
 * websocket_supervise()) is what lets nodem_task() queue a reply without
 * needing to know or care whether a websocket is even connected right
 * now.
 *
 * Sized well past a single websocket_recv_msg() chunk (see
 * MODEM_WS_RECV_BUF_SIZE) rather than just big enough for one - nodem_task()
 * only gets to drain ws_rx_ring once per ~17ms render cycle, in which it
 * also has UART processing, a DOM update, and a display flush to do, so it
 * won't always keep pace with a large "pkg" transfer's incoming rate on
 * every single cycle. The ring absorbs that jitter; 512B (worth roughly
 * one nodem_task cycle at typical LTE-M/NB-IoT throughput) wasn't enough
 * headroom and dropped bytes partway through larger transfers once it
 * stayed full for more than a cycle or two. */
#define MODEM_WS_RING_SIZE 4096
RING_BUF_DECLARE(ws_rx_ring, MODEM_WS_RING_SIZE);
RING_BUF_DECLARE(ws_tx_ring, MODEM_WS_RING_SIZE);

size_t modem_ws_read(uint8_t *buf, size_t max_len)
{
	return ring_buf_get(&ws_rx_ring, buf, max_len);
}

size_t modem_ws_write(const uint8_t *buf, size_t len)
{
	return ring_buf_put(&ws_tx_ring, buf, len);
}

/* Tracks the default PDP context (cid 0) brought up as part of
 * lte_lc_connect() - set/cleared by lte_lc_evt_handler(), consumed by
 * step_pdn_connect() and the post-connect supervisor loop below. */
static atomic_t g_pdn_up = ATOMIC_INIT(0);
static K_SEM_DEFINE(pdn_activated_sem, 0, 1);

