saschaklick/nodem-nrf9151/zephyr-app/src/modem_task.c
static bool registration_pending(void)
{
	char code[REG_CODE_LEN + 1];

	config_get_str("reg_code", code, sizeof(code), "");
	return code[0] != '\0' && strcmp(code, REG_CODE_REJECTED) != 0;
}

static bool device_registered(void)
{
	char id[REG_ID_LEN];

	config_get_str("device_id", id, sizeof(id), "");
	return id[0] != '\0';
}

static int get_imei(char *buf, size_t buf_len)
{
	char resp[32];
	int err = nrf_modem_at_cmd(resp, sizeof(resp), "AT+CGSN");

	if (err) {
		return err;
	}

	size_t len = 0;

	while (len < sizeof(resp) && isdigit((unsigned char)resp[len])) {
		len++;
	}

	if (len == 0 || len >= buf_len) {
		return -EINVAL;
	}

	memcpy(buf, resp, len);
	buf[len] = '\0';
	return 0;
}

/* Sends the registration HTTP request over `fd` and parses the "#id,<id>,
 * <secret>,<verified_name>" reply out of the response body. "Connection:
 * close" is intentional, not an oversight - the server closing the socket
 * afterward is what feeds this firmware's existing TLS-drop recovery (see
 * modem_task(), which always reconnects a fresh TLS socket right after this
 * runs) rather than needing separate keep-alive/Content-Length handling
 * here.
 *
 * 1024, not something smaller, because Cloudflare's own Report-To/NEL
 * headers alone run 300+ bytes - a buffer sized just for the small "#id,..."
 * body plus "normal" headers filled up (and thus stopped recv()ing) before
 * ever reaching the blank line separating headers from body, let alone the
 * body itself, which looked exactly like the server having sent no body at
 * all until this was found. */
#define REG_RESP_BUF_SIZE 1024

static int register_http_request(int fd, const char *host, const char *code, const char *imei,
				  const char *name, char *id_out, size_t id_out_len,
				  char *secret_out, size_t secret_out_len, char *verified_name_out,
				  size_t verified_name_out_len)
{
	char body[160];
	int body_len = snprintf(body, sizeof(body), "#reg,%s,%s,%s\r\n", code, imei, name);

	if (body_len < 0 || (size_t)body_len >= sizeof(body)) {
		return -EINVAL;
	}

	/* Sized for a full-length (127-char, config_store's cap) "cloud_host"
	 * plus the rest of the request with room to spare. */
	char req[384];
	int req_len = snprintf(req, sizeof(req),
				"POST /api/devices/register HTTP/1.1\r\n"
				"Host: %s\r\n"
				"Content-Type: text/plain\r\n"
				"Content-Length: %d\r\n"
				"Connection: close\r\n"
				"\r\n",
				host, body_len);

	if (req_len < 0 || (size_t)req_len >= sizeof(req)) {
		return -EINVAL;
	}

	if (send(fd, req, req_len, 0) != req_len || send(fd, body, body_len, 0) != body_len) {
		return -errno;
	}

	static char resp[REG_RESP_BUF_SIZE];
	size_t resp_len = 0;

	while (resp_len < sizeof(resp) - 1) {
		ssize_t n = recv(fd, &resp[resp_len], sizeof(resp) - 1 - resp_len, 0);

		if (n < 0) {
			return -errno;
		}
		if (n == 0) {
			break;
		}
		resp_len += (size_t)n;
	}
	resp[resp_len] = '\0';

	info(TAG, "registration response (%u bytes): %s", (unsigned)resp_len, resp);

	int status = 0;

	if (sscanf(resp, "HTTP/%*d.%*d %d", &status) != 1 || status < 200 || status >= 300) {
		warn(TAG, "registration request failed, http status %d", status);
		return -EIO;
	}

	char *body_start = strstr(resp, "\r\n\r\n");

	if (body_start) {
		body_start += 4;
	}

	/* Logged on its own line, isolated from the header dump above - the
	 * body is what actually matters when "#id," parsing below fails. */
	info(TAG, "registration response body: \"%s\"", body_start ? body_start : "(no body found)");

	char *id_start = body_start ? strstr(body_start, "#id,") : NULL;

	if (!id_start) {
		warn(TAG, "registration response has no \"#id,\" in its body");
		return -EINVAL;
	}

	char *id = id_start + 4;
	char *comma1 = strchr(id, ',');

	if (!comma1) {
		warn(TAG, "registration response has no comma after the id");
		return -EINVAL;
	}
	*comma1 = '\0';

	char *secret = comma1 + 1;
	char *comma2 = strchr(secret, ',');

	if (!comma2) {
		warn(TAG, "registration response has no comma after the secret");
		return -EINVAL;
	}
	*comma2 = '\0';

	char *verified_name = comma2 + 1;
	char *name_end = strpbrk(verified_name, ",\r\n");

	if (name_end) {
		*name_end = '\0';
	}

	strncpy(id_out, id, id_out_len - 1);
	id_out[id_out_len - 1] = '\0';
	strncpy(secret_out, secret, secret_out_len - 1);
	secret_out[secret_out_len - 1] = '\0';
	strncpy(verified_name_out, verified_name, verified_name_out_len - 1);
	verified_name_out[verified_name_out_len - 1] = '\0';

	return 0;
}

/* A registration code in config_store always means "(re)register with
 * this", overriding any already-stored device_id - consumed (cleared on
 * success, replaced with REG_CODE_REJECTED on failure) either way, so a bad
 * or already-used code doesn't retry forever.
 *
 * Always returns 0 (every failure is handled internally by rejecting the
 * code) - the caller (modem_task()) only ever calls this once, right after
 * connecting TLS specifically to make this attempt, so there's nothing left
 * to usefully retry here.
 *
 * `fd` is closed on every exit path below the point it's read - modem_task()
 * only holds a TLS connection open for as long as an actual registration
 * attempt is in progress, so nothing here may leave it open across a
 * failure, or it would sit there consuming bandwidth for no reason until
 * the next retry. */
static int step_register(void)
{
	if (!registration_pending()) {
		return 0;
	}

	char code[REG_CODE_LEN + 1];

	config_get_str("reg_code", code, sizeof(code), "");

	char name[REG_NAME_MAX_LEN + 1];

	config_get_str("device_name", name, sizeof(name), "");
	if (strlen(name) < REG_NAME_MIN_LEN || strlen(name) > REG_NAME_MAX_LEN) {
		warn(TAG, "registration code set but device name invalid, dropping code");
		config_set_str("reg_code", "");
		return 0;
	}

	int fd = (int)atomic_get(&g_tls_fd);

	if (fd < 0) {
		return 0;
	}

	char imei[REG_IMEI_LEN];
	int err = get_imei(imei, sizeof(imei));

	if (!err) {
		char id[REG_ID_LEN];
		char secret[REG_SECRET_LEN];
		char verified_name[REG_VERIFIED_NAME_LEN];

		err = register_http_request(fd, g_cloud_host, code, imei, name, id, sizeof(id),
					     secret, sizeof(secret), verified_name,
					     sizeof(verified_name));
		if (!err) {
			/* Permanent registration is complete once the id,
			 * auth secret, and server-verified device name
			 * (which may differ from what was submitted, e.g.
			 * de-duplicated) are all persisted - overwrite the
			 * tentative "device_name" with the verified one
			 * rather than leaving the locally-submitted value
			 * around. */
			config_set_str("device_id", id);
			config_set_str("device_secret", secret);
			config_set_str("device_name", verified_name);
			config_set_str("reg_code", "");
			info(TAG, "device registered, id %s name %s", id, verified_name);
		}
	}

