saschaklick/nodem-nrf9151/zephyr-app/src/modem_task.c
	for (int field = 0; field < 5 && p; field++) {
		p = strchr(p + 1, ',');
	}

	int rsrp = p ? atoi(p + 1) : -1;

	return (rsrp >= 0 && rsrp <= 97) ? rsrp - 140 : INT_MIN;
}

/* Copies the `n`th (0-based) double-quoted field of `line` (up to its end of
 * line) into `buf`, or "" if there isn't one / it doesn't fit. */
static void quoted_field(const char *line, int n, char *buf, size_t buf_len)
{
	const char *eol = strpbrk(line, "\r\n");
	const char *start = line;

	buf[0] = '\0';

	for (int i = 0; i <= n; i++) {
		start = strchr(start, '"');
		if (!start || (eol && start > eol)) {
			return;
		}
		const char *end = strchr(start + 1, '"');

		if (!end || (eol && end > eol)) {
			return;
		}
		if (i == n) {
			size_t len = (size_t)(end - start - 1);

			if (len < buf_len) {
				memcpy(buf, start + 1, len);
				buf[len] = '\0';
			}
			return;
		}
		start = end + 1;
	}
}

/* The first STEP_ERROR step in `first`..`last` as "<step>(<err>)", or ""
 * if none - "#stat"'s trailing error field. */
static void step_error_str(char *buf, size_t buf_len, enum modem_step first, enum modem_step last)
{
	buf[0] = '\0';

	for (enum modem_step step = first; step <= last; step++) {
		if (atomic_get(&g_status[step].state) == STEP_ERROR) {
			snprintf(buf, buf_len, "%s(%d)", step_name[step],
				 (int)atomic_get(&g_status[step].err));
			return;
		}
	}
}

size_t modem_stat_format(char *buf, size_t buf_len)
{
	/* Modem side (INIT..PDN): nodem-esp32's wifi line has a "waiting" for
	 * an unconfigured network too, but there's no configuration step
	 * here - the modem goes straight to connecting from boot. */
	const char *modem_state = "connected";
	char modem_err[24];

	step_error_str(modem_err, sizeof(modem_err), MODEM_STEP_INIT, MODEM_STEP_PDN);

	for (enum modem_step step = MODEM_STEP_INIT; step <= MODEM_STEP_PDN; step++) {
		if (atomic_get(&g_status[step].state) != STEP_OK) {
			modem_state = modem_err[0] != '\0' ? "failed" : "connecting";
			break;
		}
	}

	char apn[64] = "";
	char ip[48] = "";
	char quality[8] = "";

	if (atomic_get(&g_pdn_up)) {
		char resp[256];

		if (!nrf_modem_at_cmd(resp, sizeof(resp), "AT+CGDCONT?")) {
			const char *line = strstr(resp, "+CGDCONT: 0,");

			if (line) {
				quoted_field(line, 1, apn, sizeof(apn));
				quoted_field(line, 2, ip, sizeof(ip));
				/* Dual-stack contexts list "<ipv4> <ipv6>" -
				 * keep just the first. */
				char *sp = strchr(ip, ' ');

				if (sp) {
					*sp = '\0';
				}
			}
		}

		int dbm = modem_rsrp_dbm();

		if (dbm != INT_MIN) {
			snprintf(quality, sizeof(quality), "%d", dbm);
		}
	}

	/* Cloud side - same precedence as modem_task() itself: a pending
	 * reg_code always wins (even over an existing registration), then an
	 * existing device_id, then a code the server rejected. */
	const char *reg_state;
	char cloud_err[24];
	char code[REG_CODE_LEN + 1];

	step_error_str(cloud_err, sizeof(cloud_err), MODEM_STEP_TLS, MODEM_STEP_WEBSOCKET);
	config_get_str("reg_code", code, sizeof(code), "");

	if (registration_pending()) {
		reg_state = "registering";
	} else if (device_registered()) {
		reg_state = "registered";
	} else if (strcmp(code, REG_CODE_REJECTED) == 0) {
		reg_state = "failed";
		if (cloud_err[0] == '\0') {
			snprintf(cloud_err, sizeof(cloud_err), "rejected");
		}
	} else {
		reg_state = "waiting";
	}

	const char *conn_state = "disconnected";

	if (atomic_get(&g_status[MODEM_STEP_WEBSOCKET].state) == STEP_OK) {
		conn_state = "connected";
	} else {
		for (enum modem_step step = MODEM_STEP_TLS; step <= MODEM_STEP_WEBSOCKET; step++) {
			if (atomic_get(&g_status[step].state) == STEP_RUNNING) {
				conn_state = "connecting";
				break;
			}
		}
	}

	char host[CLOUD_HOST_LEN];
	char name[REG_NAME_MAX_LEN + 1];

	get_cloud_host(host, sizeof(host));
	config_get_str("device_name", name, sizeof(name), "");

	int n = snprintf(buf, buf_len,
			 "modem,%s,%s,%s,%s,%s\r\n"
			 "cloud,%s,%s,%s,%s,%s\r\n",
			 modem_state, apn, ip, quality, modem_err,
			 reg_state, conn_state, host, name, cloud_err);

	return n > 0 ? (size_t)n : 0;
}

int modem_core_temp(int *temp_c)
{
	if (atomic_get(&g_status[MODEM_STEP_INIT].state) != STEP_OK) {
		return -EAGAIN;
	}

	int err = nrf_modem_at_scanf("AT%XTEMP?", "%%XTEMP: %d", temp_c);

	return err == 1 ? 0 : (err < 0 ? err : -EIO);
}


#define MODEM_STATUS_PERIOD_MS 200 /* 5 Hz */

/* MODEM_STEP_REGISTER is a one-time bootstrap step: modem_task()'s
 * MODEM_STEP_TLS case only routes through it while registration_pending()
 * holds, going straight to MODEM_STEP_WEBSOCKET otherwise - so for a device
 * that's already registered (device_registered()), it never runs again on
 * any later connection cycle. Its g_status entry is left at its default
 * STEP_PENDING forever in that case, not STEP_OK, which would otherwise
 * make it look exactly like a stuck/blocking step to anything walking
 * g_status[] (modem_status_line() below, and modem_status_task()'s
 * "is everything up" check) even though there's genuinely nothing left to
 * do or report for it. */
static bool step_effectively_ok(enum modem_step step)
{
	if (step == MODEM_STEP_REGISTER && device_registered()) {
		return true;
	}

	return atomic_get(&g_status[step].state) == STEP_OK;
}

/* Formats one group's status into `buf` - the first (earliest, in `first`..
 * `last` order) step short of STEP_OK, plus its error code if it's actually
 * in STEP_ERROR (a "running"/"pending" state has no meaningful err value to
 * show), or "<group>: ok" if every step in the range already is. Used to
 * build modem_status_task()'s two-line display: one call each for the modem
 * side (INIT..PDN) and the cloud side (TLS..WEBSOCKET). */
static void modem_status_line(char *buf, size_t buf_len, const char *group, enum modem_step first,
			       enum modem_step last)
{
	for (enum modem_step step = first; step <= last; step++) {
		if (step_effectively_ok(step)) {
			continue;
		}

		enum step_state state = atomic_get(&g_status[step].state);
		int err = (int)atomic_get(&g_status[step].err);

		if (state == STEP_ERROR && err != 0) {
			snprintf(buf, buf_len, "%s: %s %s(%d)", group, step_name[step],
				 state_name(state), err);
		} else {
			snprintf(buf, buf_len, "%s: %s %s", group, step_name[step], state_name(state));
		}
		return;
	}

	snprintf(buf, buf_len, "%s: ok", group);
}

